In [1]:
#对比excel学习pandas
import pandas as pd
df=pd.read_excel("D:/Python/课堂/14次/14-pandas（2）/data/梁山108将.xlsx")
df

      座次   姓名       绰号   星宿                    梁山泊职位
0      1   宋江  呼保义/及时雨  天魁星                  总督兵马大元帅
1      2  卢俊义      玉麒麟  天罡星                  总督兵马副元帅
2      3   吴用      智多星  天机星                  掌管机密正军师
3      4  公孙胜      入云龙  天闲星                  掌管机密副军师
4      5   关胜       大刀  天勇星    马军五虎将之首兼左军大将领正东旱寨守尉主将
..   ...  ...      ...  ...                      ...
103  104  王定六      活闪婆  地劣星        内务处迎宾八使之八兼北山酒店副掌店
104  105  郁保四      险道神  地健星  内务处十六监造十六兼掌旗营指挥知专捧帅字旗帜事
105  106   白胜      白日鼠  地耗星          走报机密四校之二兼细作队都统制
106  107   时迁      鼓上蚤  地贼星          走报机密四校之三兼侦查队都统制
107  108  段景住      金毛犬  地狗星          走报机密四校之四兼斥候队都统制

[108 rows x 5 columns]

In [2]:
print(type(df))   #打印数据的数据结构

<class 'pandas.core.frame.DataFrame'>

In [4]:
print(df.shape)   #显示数据的形状

(108, 5)

In [5]:
df.columns  #显示每一列的索引

Index(['座次', '姓名', '绰号', '星宿', '梁山泊职位'], dtype='object')

In [6]:
df["姓名"]  #通过索引输出一列

0       宋江
1      卢俊义
2       吴用
3      公孙胜
4       关胜
      ...
103    王定六
104    郁保四
105     白胜
106     时迁
107    段景住
Name: 姓名, Length: 108, dtype: object

In [7]:
s1=df["姓名"]
print(type(s1))  #查看该列数据类型，为series，可以看出dataframe是由多个series组成的。

<class 'pandas.core.series.Series'>

In [8]:
s1

0       宋江
1      卢俊义
2       吴用
3      公孙胜
4       关胜
      ...
103    王定六
104    郁保四
105     白胜
106     时迁
107    段景住
Name: 姓名, Length: 108, dtype: object

In [10]:
pd.Series([1,2,3,4])  #通过列表创建Series

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s=pd.Series([1,2,3,4])
#获取索引
print(s.index)
#获取值
print(s.values)

RangeIndex(start=0, stop=4, step=1)
[1 2 3 4]

In [12]:
s=pd.Series([1,2,3,4],index=['a','b','c','d'])  #创建自定义索引
#获取索引
print(s.index)
#获取值
print(s.values)

Index(['a', 'b', 'c', 'd'], dtype='object')
[1 2 3 4]

In [24]:
#pandas中可以使用numpy中的功能
#获取值大于2的
print(s[s>2])

c    3
d    4
dtype: int64

In [22]:
#传递字典参数
dict_value={'1':'宋江','2':'卢俊义','3':'吴用'}
s2=pd.Series(dict_value)
print(s2)

1     宋江
2    卢俊义
3     吴用
dtype: object

In [23]:
print(s2.index)

Index(['1', '2', '3'], dtype='object')

In [25]:
#添加自定义索引
s2.index.name = '座次'
print(s2)

座次
1     宋江
2    卢俊义
3     吴用
dtype: object

In [26]:
import pandas as pd
data=[['1','宋江'],['2','卢俊义'],['3','吴用']]
df=pd.DataFrame(data)
print(df)
print(type(df))

   0    1
0  1   宋江
1  2  卢俊义
2  3   吴用
<class 'pandas.core.frame.DataFrame'>

In [27]:
df=pd.DataFrame(data,index=['rank1','rank2','rank3'],columns=['座次','姓名'])
print(df)

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [28]:
data={'座次':['1','2','3'],'姓名':['宋江','卢俊义','吴用']}
df=pd.DataFrame(data,index=['rank1','rank2','rank3'])
print(df)

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [30]:
#使用列表字典
data = [{'座次':'1','姓名':'宋江'},{'座次':'2','姓名':'卢俊义'},{'座次':'3','姓名':'吴用'}]
df = pd.DataFrame(data,index=['rank1','rank2','rank3'])
print(df)

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [31]:
#使用series
s1 = pd.Series(['1','宋江'])
s2 = pd.Series(['2','卢俊义'])
s3 = pd.Series(['3','吴用'])
data = [s1,s2,s3]
df = pd.DataFrame(data,index=['rank1','rank2','rank3'])
print(df)

       0    1
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [32]:
df=pd.read_excel("D:/Python/课堂/14次/14-pandas（2）/data/梁山108将.xlsx")
df

      座次   姓名       绰号   星宿                    梁山泊职位
0      1   宋江  呼保义/及时雨  天魁星                  总督兵马大元帅
1      2  卢俊义      玉麒麟  天罡星                  总督兵马副元帅
2      3   吴用      智多星  天机星                  掌管机密正军师
3      4  公孙胜      入云龙  天闲星                  掌管机密副军师
4      5   关胜       大刀  天勇星    马军五虎将之首兼左军大将领正东旱寨守尉主将
..   ...  ...      ...  ...                      ...
103  104  王定六      活闪婆  地劣星        内务处迎宾八使之八兼北山酒店副掌店
104  105  郁保四      险道神  地健星  内务处十六监造十六兼掌旗营指挥知专捧帅字旗帜事
105  106   白胜      白日鼠  地耗星          走报机密四校之二兼细作队都统制
106  107   时迁      鼓上蚤  地贼星          走报机密四校之三兼侦查队都统制
107  108  段景住      金毛犬  地狗星          走报机密四校之四兼斥候队都统制

[108 rows x 5 columns]

In [33]:
data = [{'座次':'1','姓名':'宋江'},{'座次':'2','姓名':'卢俊义'},{'座次':'3','姓名':'吴用'}]
df = pd.DataFrame(data,index=['rank1','rank2','rank3'])
print(df)

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [34]:
#新增列
df['绰号']=['及时雨','玉麒麟','智多星']
df

      座次   姓名   绰号
rank1  1   宋江  及时雨
rank2  2  卢俊义  玉麒麟
rank3  3   吴用  智多星

In [51]:
#修改列
df['绰号'] = ['呼保义','玉麒麟','智多星']
print(df)

      座次   姓名   绰号
rank1  1   宋江  呼保义
rank2  2  卢俊义  玉麒麟
rank3  3   吴用  智多星

In [42]:
#获取一列
df['姓名']

rank1     宋江
rank2    卢俊义
rank3     吴用
Name: 姓名, dtype: object

In [43]:
print(type(df['姓名']))

<class 'pandas.core.series.Series'>

In [44]:
#删除列
del df['绰号']

In [45]:
df

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [48]:
df.pop('绰号')

rank1    呼保义
rank2    玉麒麟
rank3    智多星
Name: 绰号, dtype: object

In [49]:
df

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [52]:
df.drop(columns=['绰号'])

      座次   姓名
rank1  1   宋江
rank2  2  卢俊义
rank3  3   吴用

In [53]:
df

      座次   姓名   绰号
rank1  1   宋江  呼保义
rank2  2  卢俊义  玉麒麟
rank3  3   吴用  智多星

In [ ]:
#删除列总结
#del 直接删除源数据，没有返回值
#df.pop() 直接删除源数据，返回删除的series
#df.drop() 不删除源数据

In [54]:
# 获取行
df.loc['rank1'] #返回的是转置后的series，为了方便操作。

座次      1
姓名     宋江
绰号    呼保义
Name: rank1, dtype: object

In [55]:
#iloc 通过整数值索引
rank2 = df.iloc[1]
print(rank2)

座次      2
姓名    卢俊义
绰号    玉麒麟
Name: rank2, dtype: object

In [56]:
#添加行
df.loc['rank4'] = ['4','公孙胜','入云龙']
print(df)

      座次   姓名   绰号
rank1  1   宋江  呼保义
rank2  2  卢俊义  玉麒麟
rank3  3   吴用  智多星
rank4  4  公孙胜  入云龙

In [57]:
df.loc['rank5'] = {'姓名':'关胜','绰号':'大刀','座次':'5'}
print(df)

      座次   姓名   绰号
rank1  1   宋江  呼保义
rank2  2  卢俊义  玉麒麟
rank3  3   吴用  智多星
rank4  4  公孙胜  入云龙
rank5  5   关胜   大刀

In [58]:
#修改行
df.loc['rank5'] = ['5','关胜','大刀关胜']
print(df)

      座次   姓名    绰号
rank1  1   宋江   呼保义
rank2  2  卢俊义   玉麒麟
rank3  3   吴用   智多星
rank4  4  公孙胜   入云龙
rank5  5   关胜  大刀关胜

In [59]:
#删除行
df1 = df.drop(index = ['rank3','rank5'])
print(df1)
print(df)
#drop方法会保留源数据

      座次   姓名   绰号
rank1  1   宋江  呼保义
rank2  2  卢俊义  玉麒麟
rank4  4  公孙胜  入云龙
      座次   姓名    绰号
rank1  1   宋江   呼保义
rank2  2  卢俊义   玉麒麟
rank3  3   吴用   智多星
rank4  4  公孙胜   入云龙
rank5  5   关胜  大刀关胜

In [60]:
df1 = df.drop(index = ['rank3','rank5'],inplace=True) #不保留原始数据
print(df1)
print(df)

None
      座次   姓名   绰号
rank1  1   宋江  呼保义
rank2  2  卢俊义  玉麒麟
rank4  4  公孙胜  入云龙

In [4]:
df=pd.read_excel("D:/Python/课堂/14次/14-pandas（2）/data/梁山108将.xlsx")
df

      座次   姓名       绰号   星宿                    梁山泊职位
0      1   宋江  呼保义/及时雨  天魁星                  总督兵马大元帅
1      2  卢俊义      玉麒麟  天罡星                  总督兵马副元帅
2      3   吴用      智多星  天机星                  掌管机密正军师
3      4  公孙胜      入云龙  天闲星                  掌管机密副军师
4      5   关胜       大刀  天勇星    马军五虎将之首兼左军大将领正东旱寨守尉主将
..   ...  ...      ...  ...                      ...
103  104  王定六      活闪婆  地劣星        内务处迎宾八使之八兼北山酒店副掌店
104  105  郁保四      险道神  地健星  内务处十六监造十六兼掌旗营指挥知专捧帅字旗帜事
105  106   白胜      白日鼠  地耗星          走报机密四校之二兼细作队都统制
106  107   时迁      鼓上蚤  地贼星          走报机密四校之三兼侦查队都统制
107  108  段景住      金毛犬  地狗星          走报机密四校之四兼斥候队都统制

[108 rows x 5 columns]

In [5]:
df.head()

   座次   姓名       绰号   星宿                  梁山泊职位
0   1   宋江  呼保义/及时雨  天魁星                总督兵马大元帅
1   2  卢俊义      玉麒麟  天罡星                总督兵马副元帅
2   3   吴用      智多星  天机星                掌管机密正军师
3   4  公孙胜      入云龙  天闲星                掌管机密副军师
4   5   关胜       大刀  天勇星  马军五虎将之首兼左军大将领正东旱寨守尉主将

In [6]:
df.tail()

      座次   姓名   绰号   星宿                    梁山泊职位
103  104  王定六  活闪婆  地劣星        内务处迎宾八使之八兼北山酒店副掌店
104  105  郁保四  险道神  地健星  内务处十六监造十六兼掌旗营指挥知专捧帅字旗帜事
105  106   白胜  白日鼠  地耗星          走报机密四校之二兼细作队都统制
106  107   时迁  鼓上蚤  地贼星          走报机密四校之三兼侦查队都统制
107  108  段景住  金毛犬  地狗星          走报机密四校之四兼斥候队都统制

In [7]:
df.index#行索引

RangeIndex(start=0, stop=108, step=1)

In [8]:
df.columns#列索引

Index(['座次', '姓名', '绰号', '星宿', '梁山泊职位'], dtype='object')

In [9]:
#获取前10行数据
df[0:11]

    座次   姓名       绰号   星宿                  梁山泊职位
0    1   宋江  呼保义/及时雨  天魁星                总督兵马大元帅
1    2  卢俊义      玉麒麟  天罡星                总督兵马副元帅
2    3   吴用      智多星  天机星                掌管机密正军师
3    4  公孙胜      入云龙  天闲星                掌管机密副军师
4    5   关胜       大刀  天勇星  马军五虎将之首兼左军大将领正东旱寨守尉主将
5    6   林冲      豹子头  天雄星  马军五虎将之二兼右军大将领正西旱寨守尉主将
6    7   秦明      霹雳火  天猛星  马军五虎将之三兼先锋大将领正南旱寨守尉主将
7    8  呼延灼       双鞭  天威星  马军五虎将之四兼合后大将领正北旱寨守尉主将
8    9   花荣      小李广  天英星   马军八骠骑兼先锋使之首领寨外讨虏游尉主将
9   10   柴进      小旋风  天贵星           内务处大总管兼钱银库都监
10  11   李应      扑天雕  天富星           内务处副总管兼粮草库都监

In [10]:
#获取一列
df['姓名']

0       宋江
1      卢俊义
2       吴用
3      公孙胜
4       关胜
      ...
103    王定六
104    郁保四
105     白胜
106     时迁
107    段景住
Name: 姓名, Length: 108, dtype: object

In [11]:
#获取多列
df[['姓名','绰号','梁山泊职位']]

      姓名       绰号                    梁山泊职位
0     宋江  呼保义/及时雨                  总督兵马大元帅
1    卢俊义      玉麒麟                  总督兵马副元帅
2     吴用      智多星                  掌管机密正军师
3    公孙胜      入云龙                  掌管机密副军师
4     关胜       大刀    马军五虎将之首兼左军大将领正东旱寨守尉主将
..   ...      ...                      ...
103  王定六      活闪婆        内务处迎宾八使之八兼北山酒店副掌店
104  郁保四      险道神  内务处十六监造十六兼掌旗营指挥知专捧帅字旗帜事
105   白胜      白日鼠          走报机密四校之二兼细作队都统制
106   时迁      鼓上蚤          走报机密四校之三兼侦查队都统制
107  段景住      金毛犬          走报机密四校之四兼斥候队都统制

[108 rows x 3 columns]

In [12]:
df.loc[5:10,['姓名','绰号']] #获取指定行列信息

     姓名   绰号
5    林冲  豹子头
6    秦明  霹雳火
7   呼延灼   双鞭
8    花荣  小李广
9    柴进  小旋风
10   李应  扑天雕

In [13]:
df.loc[5:10,'姓名':'梁山泊职位']

     姓名   绰号   星宿                  梁山泊职位
5    林冲  豹子头  天雄星  马军五虎将之二兼右军大将领正西旱寨守尉主将
6    秦明  霹雳火  天猛星  马军五虎将之三兼先锋大将领正南旱寨守尉主将
7   呼延灼   双鞭  天威星  马军五虎将之四兼合后大将领正北旱寨守尉主将
8    花荣  小李广  天英星   马军八骠骑兼先锋使之首领寨外讨虏游尉主将
9    柴进  小旋风  天贵星           内务处大总管兼钱银库都监
10   李应  扑天雕  天富星           内务处副总管兼粮草库都监

In [14]:
df.iloc[5:10,0:3] #注意loc和iloc的区别，loc包含最后一个，iloc不包含。

   座次   姓名   绰号
5   6   林冲  豹子头
6   7   秦明  霹雳火
7   8  呼延灼   双鞭
8   9   花荣  小李广
9  10   柴进  小旋风

In [15]:
#索引值的过滤
df[df['姓名'] == '林冲']

   座次  姓名   绰号   星宿                  梁山泊职位
5   6  林冲  豹子头  天雄星  马军五虎将之二兼右军大将领正西旱寨守尉主将

In [16]:
df.reindex(columns=['姓名','绰号'])

      姓名       绰号
0     宋江  呼保义/及时雨
1    卢俊义      玉麒麟
2     吴用      智多星
3    公孙胜      入云龙
4     关胜       大刀
..   ...      ...
103  王定六      活闪婆
104  郁保四      险道神
105   白胜      白日鼠
106   时迁      鼓上蚤
107  段景住      金毛犬

[108 rows x 2 columns]

In [17]:
df.reindex(index=[9,99],columns=['绰号','姓名'])

     绰号  姓名
9   小旋风  柴进
99  小尉迟  孙新

In [18]:
s1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2 = pd.Series([11,12,13,14,15],index=['a','b','c','d','e'])
print(s1+s2)

a    12
b    14
c    16
d    18
e    20
dtype: int64

In [19]:
s1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2 = pd.Series([11,12,13,14,15],index=['a','b','c','d','f'])
print(s1+s2)

a    12.0
b    14.0
c    16.0
d    18.0
e     NaN
f     NaN
dtype: float64

In [20]:
import numpy as np
df1 = pd.DataFrame(np.arange(9).reshape(3,3),index=['宋江','李逵','武松'],columns=['语文','数学','英语'])
print(df1)

    语文  数学  英语
宋江   0   1   2
李逵   3   4   5
武松   6   7   8

In [21]:
df1['总成绩'] = df1['语文'] + df1['数学'] + df1['英语']
print(df1)

    语文  数学  英语  总成绩
宋江   0   1   2    3
李逵   3   4   5   12
武松   6   7   8   21

In [22]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3),index=['宋江','李逵','武松'],columns=['语文','数学','物理'])
print(df1+df2)

    总成绩  数学  物理  英语  语文
宋江  NaN   2 NaN NaN   0
李逵  NaN   8 NaN NaN   6
武松  NaN  14 NaN NaN  12

In [23]:
#加法add，减法sub，乘法mul，除法 div
print(df1)
print(df2)
df = df1.add(df2,fill_value=0) #为空的地方赋值为0
print(df)

    语文  数学  英语  总成绩
宋江   0   1   2    3
李逵   3   4   5   12
武松   6   7   8   21
    语文  数学  物理
宋江   0   1   2
李逵   3   4   5
武松   6   7   8
     总成绩  数学   物理   英语  语文
宋江   3.0   2  2.0  2.0   0
李逵  12.0   8  5.0  5.0   6
武松  21.0  14  8.0  8.0  12

In [28]:
import numpy as np
import pandas as pd
df1=pd.DataFrame(np.arange(9).reshape(3,3),index=['宋江','李逵','武松'],columns=['语文','数学','英语'])
print(df1)

    语文  数学  英语
宋江   0   1   2
李逵   3   4   5
武松   6   7   8

In [29]:
np.max(df1)

E:\anaconda\Lib\site-packages\numpy\core\fromnumeric.py:84: FutureWarning: In a future version, DataFrame.max(axis=None) will return a scalar max over the entire DataFrame. To retain the old behavior, use 'frame.max(axis=0)' or just 'frame.max()'
  return reduction(axis=axis, out=out, **passkwargs)

语文    6
数学    7
英语    8
dtype: int32

In [30]:
np.max(df1,axis=1)

宋江    2
李逵    5
武松    8
dtype: int32

In [31]:
def text(df):
    return df.max()-df.min()

df1.apply(text)

语文    6
数学    6
英语    6
dtype: int64

In [32]:
df1.apply(text,axis=1)

宋江    2
李逵    2
武松    2
dtype: int64

In [33]:
df1.apply(lambda x:x.max() - x.min())

语文    6
数学    6
英语    6
dtype: int64

In [34]:
def total(df1):
    df1['总分'] = df1['语文'] + df1['数学'] + df1['英语']
    return df1
df1.apply(total,axis = 1)

    语文  数学  英语  总分
宋江   0   1   2   3
李逵   3   4   5  12
武松   6   7   8  21

In [35]:
df1

    语文  数学  英语
宋江   0   1   2
李逵   3   4   5
武松   6   7   8

In [36]:
df1.rename({'宋江':'songjiang','李逵':'likui','武松':'wusong'},axis='index')

           语文  数学  英语
songjiang   0   1   2
likui       3   4   5
wusong      6   7   8

In [37]:
df1

    语文  数学  英语
宋江   0   1   2
李逵   3   4   5
武松   6   7   8

In [39]:
df1.rename({'宋江':'songjiang','李逵':'likui','武松':'wusong'},axis=0,inplace=True)
df1

           语文  数学  英语
songjiang   0   1   2
likui       3   4   5
wusong      6   7   8

In [40]:
df1.sort_index()

           语文  数学  英语
likui       3   4   5
songjiang   0   1   2
wusong      6   7   8

In [41]:
df1.sort_index(ascending=False)

           语文  数学  英语
wusong      6   7   8
songjiang   0   1   2
likui       3   4   5

In [43]:
df1.rename({'语文':'yuwen','数学':'shuxue','英语':'yingyu'},axis=1,inplace=True)
df1

           yuwen  shuxue  yingyu
songjiang      0       1       2
likui          3       4       5
wusong         6       7       8

In [44]:
df1.sort_index(axis=1)

           shuxue  yingyu  yuwen
songjiang       1       2      0
likui           4       5      3
wusong          7       8      6

In [48]:
df1.sort_index(axis=1,ascending=False)

           yuwen  yingyu  shuxue
songjiang      0       2       1
likui          3       5       4
wusong         6       8       7

In [49]:
df1.sort_values(by=['shuxue'])

           yuwen  shuxue  yingyu
songjiang      0       1       2
likui          3       4       5
wusong         6       7       8

In [50]:
df1.sort_values(by=['shuxue','yingyu'])

           yuwen  shuxue  yingyu
songjiang      0       1       2
likui          3       4       5
wusong         6       7       8

In [51]:
df1

           yuwen  shuxue  yingyu
songjiang      0       1       2
likui          3       4       5
wusong         6       7       8

In [52]:
df1.count()

yuwen     3
shuxue    3
yingyu    3
dtype: int64

In [53]:
df1.max()

yuwen     6
shuxue    7
yingyu    8
dtype: int32

In [54]:
df1.sum()

yuwen      9
shuxue    12
yingyu    15
dtype: int64

In [55]:
df1.sum(axis = 1)

songjiang     3
likui        12
wusong       21
dtype: int64

In [56]:
df1.describe()

       yuwen  shuxue  yingyu
count    3.0     3.0     3.0
mean     3.0     4.0     5.0
std      3.0     3.0     3.0
min      0.0     1.0     2.0
25%      1.5     2.5     3.5
50%      3.0     4.0     5.0
75%      4.5     5.5     6.5
max      6.0     7.0     8.0

In [57]:
data = {'name':['andy','jacky'],'age':['18','20']}
df = pd.DataFrame(data)
print(df)
print(df.describe())

    name age
0   andy  18
1  jacky  20
        name age
count      2   2
unique     2   2
top     andy  18
freq       1   1

In [58]:
df1['yingyu'] = [np.nan,5,8]
df1

           yuwen  shuxue  yingyu
songjiang      0       1     NaN
likui          3       4     5.0
wusong         6       7     8.0

In [59]:
df1.sum()

yuwen      9.0
shuxue    12.0
yingyu    13.0
dtype: float64

In [60]:
df1

           yuwen  shuxue  yingyu
songjiang      0       1     NaN
likui          3       4     5.0
wusong         6       7     8.0

In [61]:
df1.isnull()

           yuwen  shuxue  yingyu
songjiang  False   False    True
likui      False   False   False
wusong     False   False   False

In [62]:
df1.notnull()

           yuwen  shuxue  yingyu
songjiang   True    True   False
likui       True    True    True
wusong      True    True    True

In [63]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, songjiang to wusong
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   yuwen   3 non-null      int32
 1   shuxue  3 non-null      int32
 2   yingyu  2 non-null      float64
dtypes: float64(1), int32(2)
memory usage: 180.0+ bytes

In [64]:
df1.dropna()

        yuwen  shuxue  yingyu
likui       3       4     5.0
wusong      6       7     8.0

In [65]:
df1.dropna(axis = 1)

           yuwen  shuxue
songjiang      0       1
likui          3       4
wusong         6       7

In [66]:
df1

           yuwen  shuxue  yingyu
songjiang      0       1     NaN
likui          3       4     5.0
wusong         6       7     8.0

In [67]:
df1.loc['wuyong']=[np.nan,np.nan,np.nan]
df1

           yuwen  shuxue  yingyu
songjiang    0.0     1.0     NaN
likui        3.0     4.0     5.0
wusong       6.0     7.0     8.0
wuyong       NaN     NaN     NaN

In [70]:
df1.dropna(how='all',inplace=True)
df1

           yuwen  shuxue  yingyu
songjiang    0.0     1.0     NaN
likui        3.0     4.0     5.0
wusong       6.0     7.0     8.0

In [71]:
df1.fillna(0) #填充0的误差太大

           yuwen  shuxue  yingyu
songjiang    0.0     1.0     0.0
likui        3.0     4.0     5.0
wusong       6.0     7.0     8.0

In [72]:
df1.fillna(df1.mean())#平均值

           yuwen  shuxue  yingyu
songjiang    0.0     1.0     6.5
likui        3.0     4.0     5.0
wusong       6.0     7.0     8.0

In [75]:
movies = pd.read_csv("D:/Python/课堂/14次/14-pandas（2）/data/豆瓣TOP250.txt")
movies

      肖申克的救赎 The Shawshank Redemption|9.6|(1005725人评价)
0                         这个杀手不太冷 Léon|9.4|(945608人评价)
1                    阿甘正传 Forrest Gump|9.4|(804207人评价)
2                                 霸王别姬|9.5|(731356人评价)
3                 美丽人生 La vita è bella|9.5|(469717人评价)
4    海上钢琴师 La leggenda del pianista sull'oceano|9.2...
..                                                 ...
244                你看起来好像很好吃 おまえうまそうだな|8.8|(166414人评价)
245          那些年，我们一起追的女孩 那些年，我們一起追的女孩|8.1|(522910人评价)
246             再见我们的幼儿园 さよならぼくたちのようちえん|8.7|(94329人评价)
247                     就是这样 This Is It|8.7|(77153人评价)
248            被解救的姜戈 Django Unchained|8.5|(268718人评价)

[249 rows x 1 columns]

In [76]:
print(movies.columns)

Index(['肖申克的救赎 The Shawshank Redemption|9.6|(1005725人评价)'], dtype='object')

In [77]:
movies = pd.read_csv("D:/Python/课堂/14次/14-pandas（2）/data/豆瓣TOP250.txt",sep='|')
movies

                肖申克的救赎 The Shawshank Redemption  9.6 (1005725人评价)
0                                  这个杀手不太冷 Léon  9.4  (945608人评价)
1                             阿甘正传 Forrest Gump  9.4  (804207人评价)
2                                          霸王别姬  9.5  (731356人评价)
3                          美丽人生 La vita è bella  9.5  (469717人评价)
4    海上钢琴师 La leggenda del pianista sull'oceano  9.2  (651756人评价)
..                                          ...  ...          ...
244                         你看起来好像很好吃 おまえうまそうだな  8.8  (166414人评价)
245                   那些年，我们一起追的女孩 那些年，我們一起追的女孩  8.1  (522910人评价)
246                     再见我们的幼儿园 さよならぼくたちのようちえん  8.7   (94329人评价)
247                             就是这样 This Is It  8.7   (77153人评价)
248                     被解救的姜戈 Django Unchained  8.5  (268718人评价)

[249 rows x 3 columns]

In [79]:
movies = pd.read_csv("D:/Python/课堂/14次/14-pandas（2）/data/豆瓣TOP250.txt",sep='|',header=None)
movies

                                   0    1             2
0    肖申克的救赎 The Shawshank Redemption  9.6  (1005725人评价)
1                       这个杀手不太冷 Léon  9.4   (945608人评价)
2                  阿甘正传 Forrest Gump  9.4   (804207人评价)
3                               霸王别姬  9.5   (731356人评价)
4               美丽人生 La vita è bella  9.5   (469717人评价)
..                               ...  ...           ...
245              你看起来好像很好吃 おまえうまそうだな  8.8   (166414人评价)
246        那些年，我们一起追的女孩 那些年，我們一起追的女孩  8.1   (522910人评价)
247          再见我们的幼儿园 さよならぼくたちのようちえん  8.7    (94329人评价)
248                  就是这样 This Is It  8.7    (77153人评价)
249          被解救的姜戈 Django Unchained  8.5   (268718人评价)

[250 rows x 3 columns]

In [80]:
movies = pd.read_csv("D:/Python/课堂/14次/14-pandas（2）/data/豆瓣TOP250.txt",sep='|',header=None)
movies.columns=['电影名','评分','评论数']
movies

                                 电影名   评分           评论数
0    肖申克的救赎 The Shawshank Redemption  9.6  (1005725人评价)
1                       这个杀手不太冷 Léon  9.4   (945608人评价)
2                  阿甘正传 Forrest Gump  9.4   (804207人评价)
3                               霸王别姬  9.5   (731356人评价)
4               美丽人生 La vita è bella  9.5   (469717人评价)
..                               ...  ...           ...
245              你看起来好像很好吃 おまえうまそうだな  8.8   (166414人评价)
246        那些年，我们一起追的女孩 那些年，我們一起追的女孩  8.1   (522910人评价)
247          再见我们的幼儿园 さよならぼくたちのようちえん  8.7    (94329人评价)
248                  就是这样 This Is It  8.7    (77153人评价)
249          被解救的姜戈 Django Unchained  8.5   (268718人评价)

[250 rows x 3 columns]

In [82]:
movies = pd.read_csv("D:/Python/课堂/14次/14-pandas（2）/data/豆瓣TOP250.txt",sep='|',header=None,names=['电影名','评分','评论数'])
movies

                                 电影名   评分           评论数
0    肖申克的救赎 The Shawshank Redemption  9.6  (1005725人评价)
1                       这个杀手不太冷 Léon  9.4   (945608人评价)
2                  阿甘正传 Forrest Gump  9.4   (804207人评价)
3                               霸王别姬  9.5   (731356人评价)
4               美丽人生 La vita è bella  9.5   (469717人评价)
..                               ...  ...           ...
245              你看起来好像很好吃 おまえうまそうだな  8.8   (166414人评价)
246        那些年，我们一起追的女孩 那些年，我們一起追的女孩  8.1   (522910人评价)
247          再见我们的幼儿园 さよならぼくたちのようちえん  8.7    (94329人评价)
248                  就是这样 This Is It  8.7    (77153人评价)
249          被解救的姜戈 Django Unchained  8.5   (268718人评价)

[250 rows x 3 columns]

In [83]:
movies.to_csv('250.txt')

In [84]:
movies.to_csv('250.txt',header=None,index=False)

In [85]:
movies.to_csv('250.csv',index=False)

In [87]:
data = pd.read_csv('250.csv',nrows=10,na_values=0,skiprows=10)
data

                  三傻大闹宝莱坞 3 Idiots  9.2  (758367人评价)
0                    泰坦尼克号 Titanic  9.2  (743837人评价)
1                   盗梦空间 Inception  9.3  (844576人评价)
2             放牛班的春天 Les choristes  9.2  (506961人评价)
3                       龙猫 となりのトトロ  9.1  (467815人评价)
4      忠犬八公的故事 Hachi: A Dog's Tale  9.2  (522090人评价)
5                 教父 The Godfather  9.2  (381041人评价)
6            大话西游之大圣娶亲 西遊記大結局之仙履奇緣  9.2  (554001人评价)
7          乱世佳人 Gone with the Wind  9.2  (296621人评价)
8      天堂电影院 Nuovo Cinema Paradiso  9.1  (335287人评价)
9  当幸福来敲门 The Pursuit of Happyness  8.9  (599730人评价)

In [89]:
import pandas as pd

movies = pd.read_csv("250.csv")

movies

                                 电影名   评分           评论数
0    肖申克的救赎 The Shawshank Redemption  9.6  (1005725人评价)
1                       这个杀手不太冷 Léon  9.4   (945608人评价)
2                  阿甘正传 Forrest Gump  9.4   (804207人评价)
3                               霸王别姬  9.5   (731356人评价)
4               美丽人生 La vita è bella  9.5   (469717人评价)
..                               ...  ...           ...
245              你看起来好像很好吃 おまえうまそうだな  8.8   (166414人评价)
246        那些年，我们一起追的女孩 那些年，我們一起追的女孩  8.1   (522910人评价)
247          再见我们的幼儿园 さよならぼくたちのようちえん  8.7    (94329人评价)
248                  就是这样 This Is It  8.7    (77153人评价)
249          被解救的姜戈 Django Unchained  8.5   (268718人评价)

[250 rows x 3 columns]